def word(f):
    units = {0: '', 1: 'один', 2: 'два', 3: 'три', 4: 'четыре',
             5: 'пять', 6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять'}

    first_ten = {10: 'десять', 11: 'одиннадцать', 12: 'двенадцать', 13: "тринадцать", 14: "четырнадцать",
                 15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать"}

    tens = {2: 'двадцать', 3: 'тридцать', 4: 'сорок', 5: 'пятьдесят', 6: 'шестьдесят', 7: 'семьдесят', 8: 'восеьмедят',
            9: 'девяносто', 0: ''}

    h = {1: 'сто', 2: 'двести', 3: 'триста', 4: 'четыреста', 5: 'пятьсот', 6: 'шестьсот', 7: 'семьсот',
         8: 'восемьсот', 9: 'девятьсот', 0: ''}

    res = []

    if f == 1000:
        res.append("тысяча")

    b = str(f // 100)
    b = int(b[0])
    res.append(h.get(b))

    if str(f % 100)[0] == '1':
        b = str(f % 100)
        b = int(b)
        res.append((first_ten.get(b)))
    else:
        b = str(f % 100)
        b = int(b[0])
        res.append(tens.get(b))

        b = str(f % 10)
        b = int(b[0])
        res.append(units.get(b))

    return res


a = int(input("Введите число от 1 до 1000\n"))
print(*word(a))
